# 1. По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.
#
# Например:
# 50      1 4 9 16 25 36 49
# 10      1 4 9
# 9       1 4 9
# 4       1 4
# 1       1
# 100     1 4 9 16 25 36 49 64 81 100
# 99      1 4 9 16 25 36 49 64 81

n = 1
k = 50
# k = 10
# k = 9
# k = 4
# k = 1
# k = 100
# k = 99

result = 1

while sum:
    result = n ** 2
    n += 1
    if result <= k:
        print(result)
    else:
        break
